Tekla.Structures.Filtering.BinaryFilterExpression
The BinaryFilterExpression class represents a binary expression between two filter expressions.
This class cannot be inherited.
Tekla.Structures.Filtering.BinaryFilterExpressionCollection
The following example creates these two binary filter expressions:
PartName == BEAM1  and
ObjectType == PART
using System;
using Tekla.Structures.Filtering;
using Tekla.Structures.Filtering.Categories;
using Tekla.Structures.Model;
public class FilterExample
{
// Creates a binary filter expression collection and gets objects from model database.
public void CreateBinaryFilterExpressionCollection()
{
// Creates the binary filter expressions
var partNameExpression = CreateBinaryFilterExpressionPartName();
var objectTypeExpression = CreateBinaryFilterExpressionObjectType();
// Creates the binary filter expression collection
BinaryFilterExpressionCollection filter = new BinaryFilterExpressionCollection
{
new BinaryFilterExpressionItem(partNameExpression, BinaryFilterOperatorType.BOOLEAN_AND),
new BinaryFilterExpressionItem(objectTypeExpression)
};
// Gets objects from model database
var partList = new Model().GetModelObjectSelector().GetObjectsByFilter(filter);
}
// Creates a binary filter expression: PartName == BEAM1
public BinaryFilterExpression CreateBinaryFilterExpressionPartName()
{
// Creates the filter expressions
PartFilterExpressions.Name partName = new PartFilterExpressions.Name();
StringConstantFilterExpression beam1 = new StringConstantFilterExpression("BEAM1");
// Creates the binary filter expression
return new BinaryFilterExpression(partName, StringOperatorType.IS_EQUAL, beam1);
}
// Creates a binary filter expression: ObjectType == PART
public BinaryFilterExpression CreateBinaryFilterExpressionObjectType()
{
// Creates the filter expressions
ObjectFilterExpressions.Type objectType = new ObjectFilterExpressions.Type();
NumericConstantFilterExpression typePart = new NumericConstantFilterExpression(Tekla.Structures.TeklaStructuresDatabaseTypeEnum.PART);
// Creates the binary filter expression
return new BinaryFilterExpression(objectType, NumericOperatorType.IS_EQUAL, typePart);
}
}